% ----------------------------------------------------------------------
%   1-00 適当な慣性テンソルJを設定して，その主慣性モーメントを求めよ
%    20210510  y.yoshimura
%    Inputs:
%   Outputs:
%   related function files:
%   note:
%   cf:
%   revisions;
%   
%   (c) 2021 yasuhiro yoshimura
%----------------------------------------------------------------------

clc
clear
close all

%% 慣性テンソル
% 対称行列であることに注意
J = [10 2 -3
    2 14 1
    -3 1 12];

%% 主慣性モーメント
[v, d] = eig(J); % 固有ベクトルv, 固有値dを求めるeig関数．
% 主慣性モーメント = 慣性テンソルの固有値なので，dそのまま．
% 三角不等式を満たさないといけない．
% つまり次式全てを満たさないと物理的におかしい慣性テンソルになっている可能性
% d(1) + d(2) > d(3), d(1) + d(3) > d(2), d(2) + d(3) > d(1)
d